#pragma once

/**
 * Name: DrugDealerSimulator
 * Version: 1.1.0.25_2022-06-21
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.UserConstructionScript
	 */
	struct AappartmentViewerPawn_C_UserConstructionScript_Params
	{	};

	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.InpActEvt_NextAppartment_K2Node_InputActionEvent_2
	 */
	struct AappartmentViewerPawn_C_InpActEvt_NextAppartment_K2Node_InputActionEvent_2_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	};

	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.InpActEvt_PreviousAppartment_K2Node_InputActionEvent_1
	 */
	struct AappartmentViewerPawn_C_InpActEvt_PreviousAppartment_K2Node_InputActionEvent_1_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	};

	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.InpActEvt_SpaceBar_K2Node_InputKeyEvent_4
	 */
	struct AappartmentViewerPawn_C_InpActEvt_SpaceBar_K2Node_InputKeyEvent_4_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	};

	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.InpActEvt_SpaceBar_K2Node_InputKeyEvent_3
	 */
	struct AappartmentViewerPawn_C_InpActEvt_SpaceBar_K2Node_InputKeyEvent_3_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	};

	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.InpActEvt_Escape_K2Node_InputKeyEvent_2
	 */
	struct AappartmentViewerPawn_C_InpActEvt_Escape_K2Node_InputKeyEvent_2_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	};

	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.InpActEvt_F10_K2Node_InputKeyEvent_1
	 */
	struct AappartmentViewerPawn_C_InpActEvt_F10_K2Node_InputKeyEvent_1_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	};

	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.InpAxisEvt_LookSideways_K2Node_InputAxisEvent_1
	 */
	struct AappartmentViewerPawn_C_InpAxisEvt_LookSideways_K2Node_InputAxisEvent_1_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.SpaceHeldDown
	 */
	struct AappartmentViewerPawn_C_SpaceHeldDown_Params
	{	};

	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.ReceivePossessed
	 */
	struct AappartmentViewerPawn_C_ReceivePossessed_Params
	{
	public:
		class AController*                                         NewController;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.ReceiveUnpossessed
	 */
	struct AappartmentViewerPawn_C_ReceiveUnpossessed_Params
	{
	public:
		class AController*                                         OldController;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.checkStreamAreas
	 */
	struct AappartmentViewerPawn_C_checkStreamAreas_Params
	{	};

	/**
	 * Function appartmentViewerPawn.appartmentViewerPawn_C.ExecuteUbergraph_appartmentViewerPawn
	 */
	struct AappartmentViewerPawn_C_ExecuteUbergraph_appartmentViewerPawn_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
