#pragma once

/**
 * Name: DrugDealerSimulator
 * Version: 1.1.0.25_2022-06-21
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function bankAppWidget.bankAppWidget_C.GetText_6
	 */
	struct UbankAppWidget_C_GetText_6_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.Get_txtLaunderPool_Text_2
	 */
	struct UbankAppWidget_C_Get_txtLaunderPool_Text_2_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.Get_txtLaunderPool_Text_1
	 */
	struct UbankAppWidget_C_Get_txtLaunderPool_Text_1_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.GetbIsEnabled_1
	 */
	struct UbankAppWidget_C_GetbIsEnabled_1_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.GetText_5
	 */
	struct UbankAppWidget_C_GetText_5_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.GetText_4
	 */
	struct UbankAppWidget_C_GetText_4_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.GetText_3
	 */
	struct UbankAppWidget_C_GetText_3_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.Get_TextBlock_24_Text_1
	 */
	struct UbankAppWidget_C_Get_TextBlock_24_Text_1_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.Get_txtAccountMoneyAll_Text_1
	 */
	struct UbankAppWidget_C_Get_txtAccountMoneyAll_Text_1_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.Get_txtLaunderLevel_Text_1
	 */
	struct UbankAppWidget_C_Get_txtLaunderLevel_Text_1_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.RefreshLaundering
	 */
	struct UbankAppWidget_C_RefreshLaundering_Params
	{
	public:
		bool                                                       ButtonEnabled;                                           // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.GetText_2
	 */
	struct UbankAppWidget_C_GetText_2_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.GetText_1
	 */
	struct UbankAppWidget_C_GetText_1_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.renderHistory
	 */
	struct UbankAppWidget_C_renderHistory_Params
	{	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.renderMoneyAmount
	 */
	struct UbankAppWidget_C_renderMoneyAmount_Params
	{
	public:
		class FText                                                AmountText;                                              // 0x0000(0x0018)  (Parm, OutParm)
	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.Construct
	 */
	struct UbankAppWidget_C_Construct_Params
	{	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.BndEvt__btnClose_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
	 */
	struct UbankAppWidget_C_BndEvt__btnClose_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.BndEvt__btnUpgradeLaunder_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UbankAppWidget_C_BndEvt__btnUpgradeLaunder_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	 */
	struct UbankAppWidget_C_BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function bankAppWidget.bankAppWidget_C.ExecuteUbergraph_bankAppWidget
	 */
	struct UbankAppWidget_C_ExecuteUbergraph_bankAppWidget_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
