#pragma once

/**
 * Name: DrugDealerSimulator
 * Version: 1.1.0.25_2022-06-21
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class DrugDealerSimulator.AbsorbedSubstance
	 * Size -> 0x0070 (FullSize[0x0098] - InheritedSize[0x0028])
	 */
	class UAbsorbedSubstance : public UObject
	{
	public:
		float                                                      takenTime;                                               // 0x0028(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      takenMass;                                               // 0x002C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      currentConcetration;                                     // 0x0030(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      takeAddictedLevel;                                       // 0x0034(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      takeAddictedFactor;                                      // 0x0038(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      takeToleranceLevel;                                      // 0x003C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      takeToleranceFactor;                                     // 0x0040(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      calcRateAbsorption;                                      // 0x0044(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      calcRateDecomposition;                                   // 0x0048(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      calcRateExcretion;                                       // 0x004C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      calcPower;                                               // 0x0050(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       stillEffective;                                          // 0x0054(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       injectionCalculated;                                     // 0x0055(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MBUO[0x2];                                   // 0x0056(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UEB_BaseFactors*                                     takenBase;                                               // 0x0058(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_BodyHealth*                                      takenHealth;                                             // 0x0060(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Spirit*                                          takenSpirit;                                             // 0x0068(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Perception*                                      takenPerception;                                         // 0x0070(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_BrainFunctions*                                  takenBrainFuncs;                                         // 0x0078(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Physical*                                        takenPhysical;                                           // 0x0080(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActiveSubstance*                                    drugPointer;                                             // 0x0088(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    substanceIndex;                                          // 0x0090(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZEOO[0x4];                                   // 0x0094(0x0004) MISSED OFFSET (PADDING)

	public:
		void MergeTakenEffects(class UAbsorbedSubstance* otherObject, float curConcentration, float substanceTolerance);
		void MergeSpiritImpact(class UEB_Spirit* Source, float takeFactor);
		void MergePhysicalImpact(class UEB_Physical* Source, float takeFactor);
		void MergePerceptionImpact(class UEB_Perception* Source, float takeFactor);
		void MergeHealthImpact(class UEB_BodyHealth* Source, float takeFactor);
		void MergeBrainFuncsImpact(class UEB_BrainFunctions* Source, float takeFactor);
		void InitFactorHandler();
		float GetQualityFactor();
		float GetPurityFactor();
		float GetFirstPowerMomentTime();
		float GetExcretedAmount(float checkDayTime);
		float GetDecompositedAmunt(float checkDayTime);
		float GetCurrentConcentration(float checkDayTime);
		float GetAbsorbedAmunt(float checkDayTime);
		void DeepCopySpirit(class UEB_Spirit* Source);
		void DeepCopyPhysical(class UEB_Physical* Source);
		void DeepCopyPerception(class UEB_Perception* Source);
		void DeepCopyHealth(class UEB_BodyHealth* Source);
		void DeepCopyBrainFuncs(class UEB_BrainFunctions* Source);
		void DeepCopyBaseF(class UEB_BaseFactors* Source);
		void CalcInjection(class AHumanoidActor* injectedObject, float checkDayTime);
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AbsorbedSubstanceComp
	 * Size -> 0x0080 (FullSize[0x0170] - InheritedSize[0x00F0])
	 */
	class UAbsorbedSubstanceComp : public UActorComponent
	{
	public:
		float                                                      takenTime;                                               // 0x00F0(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      tempCheckTime;                                           // 0x00F4(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      takenMass;                                               // 0x00F8(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      takeAddictedLevel;                                       // 0x00FC(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      takeAddictedFactor;                                      // 0x0100(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      takeToleranceLevel;                                      // 0x0104(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      takeToleranceFactor;                                     // 0x0108(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      calcRateAbsorption;                                      // 0x010C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      calcRateDecomposition;                                   // 0x0110(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      calcRateExcretion;                                       // 0x0114(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      calcPower;                                               // 0x0118(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MassToPowerFactor;                                       // 0x011C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SAEMajorVersion;                                         // 0x0120(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    SAESubVersion;                                           // 0x0124(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       stillEffective;                                          // 0x0128(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       injectionCalculated;                                     // 0x0129(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E9GE[0x6];                                   // 0x012A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UEB_BaseFactors*                                     takenBase;                                               // 0x0130(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_BodyHealth*                                      takenHealth;                                             // 0x0138(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Spirit*                                          takenSpirit;                                             // 0x0140(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Perception*                                      takenPerception;                                         // 0x0148(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_BrainFunctions*                                  takenBrainFuncs;                                         // 0x0150(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Physical*                                        takenPhysical;                                           // 0x0158(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActiveSubstance*                                    drugPointer;                                             // 0x0160(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    substanceIndex;                                          // 0x0168(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Q0OQ[0x4];                                   // 0x016C(0x0004) MISSED OFFSET (PADDING)

	public:
		bool SubstanceHaveExcreted(float checkDayTime);
		void StoreSelfData(TArray<float>* targetArray, int32_t baseOffset);
		void RestoreFromData(TArray<float> sourceArray, int32_t baseOffset);
		void MergeTakenEffects(class UAbsorbedSubstanceComp* otherObject, class ASubstancesAndEffects* handler, float curConcentration, float substanceTolerance);
		void MergeSpiritImpact(class UEB_Spirit* Source, class ASubstancesAndEffects* handler, float takeFactor);
		void MergePhysicalImpact(class UEB_Physical* Source, class ASubstancesAndEffects* handler, float takeFactor);
		void MergePerceptionImpact(class UEB_Perception* Source, class ASubstancesAndEffects* handler, float takeFactor);
		void MergeHealthImpact(class UEB_BodyHealth* Source, class ASubstancesAndEffects* handler, float takeFactor);
		void MergeBrainFuncsImpact(class UEB_BrainFunctions* Source, class ASubstancesAndEffects* handler, float takeFactor);
		void InitFactorHandler();
		float GetQualityFactor();
		float GetPurityFactor();
		float GetFirstPowerMomentTime();
		float GetExcretedAmount(float checkDayTime);
		float GetDecompositedAmount(float checkDayTime);
		float GetCurrentConcentration(float checkDayTime);
		float GetAbsorbedAmunt(float checkDayTime);
		void DeepCopySpirit(class UEB_Spirit* Source);
		void DeepCopyPhysical(class UEB_Physical* Source);
		void DeepCopyPerception(class UEB_Perception* Source);
		void DeepCopyHealth(class UEB_BodyHealth* Source);
		void DeepCopyBrainFuncs(class UEB_BrainFunctions* Source);
		void DeepCopyBaseF(class UEB_BaseFactors* Source);
		void CalcInjection(class AHumanoidActor* injectedObject, float checkDayTime);
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AbsorbedSubstancesComponent
	 * Size -> 0x0000 (FullSize[0x00F0] - InheritedSize[0x00F0])
	 */
	class UAbsorbedSubstancesComponent : public UActorComponent
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.ActionableActor
	 * Size -> 0x0008 (FullSize[0x0330] - InheritedSize[0x0328])
	 */
	class AActionableActor : public AActor
	{
	public:
		int32_t                                                    innerIndex;                                              // 0x0328(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    innerSubIndex;                                           // 0x032C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.ActiveSubstance
	 * Size -> 0x00C0 (FullSize[0x03E8] - InheritedSize[0x0328])
	 */
	class AActiveSubstance : public AActor
	{
	public:
		class UEB_BaseFactors*                                     BaseFactors;                                             // 0x0328(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                substanceName;                                           // 0x0330(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    innerIndex;                                              // 0x0338(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QZU2[0x4];                                   // 0x033C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UEB_BodyHealth*                                      BodyFastImpact;                                          // 0x0340(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_BodyHealth*                                      BodyAddictionImpact;                                     // 0x0348(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_BodyHealth*                                      BodyExcretionImpact;                                     // 0x0350(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Spirit*                                          SpiritFastImpact;                                        // 0x0358(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Spirit*                                          SpiritAddictionImpact;                                   // 0x0360(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Spirit*                                          SpiritExcretionImpact;                                   // 0x0368(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Perception*                                      PerceptionFastImpact;                                    // 0x0370(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Perception*                                      PerceptionAddictionImpact;                               // 0x0378(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Perception*                                      PerceptionExcretionImpact;                               // 0x0380(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_BrainFunctions*                                  BrainFuncsFastImpact;                                    // 0x0388(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_BrainFunctions*                                  BrainFuncsAddictionImpact;                               // 0x0390(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_BrainFunctions*                                  BrainFuncsExcretionImpact;                               // 0x0398(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Physical*                                        PhysicalFastImpact;                                      // 0x03A0(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Physical*                                        PhysicalAddictionImpact;                                 // 0x03A8(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UEB_Physical*                                        PhysicalExcretionImpact;                                 // 0x03B0(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      neutralPurityPoint;                                      // 0x03B8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      goodPurityPoint;                                         // 0x03BC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      neutralQualityPoint;                                     // 0x03C0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      goodQualityPoint;                                        // 0x03C4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      fullToleranceAchiveIn;                                   // 0x03C8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      maxToleranceFactor;                                      // 0x03CC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      fullAddictionAchiveIn;                                   // 0x03D0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      toleranceRecoveryDays;                                   // 0x03D4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      addictionRecoveryDays;                                   // 0x03D8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      pruityDebug;                                             // 0x03DC(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      qualityDebug;                                            // 0x03E0(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HJXC[0x4];                                   // 0x03E4(0x0004) MISSED OFFSET (PADDING)

	public:
		float GetQualityFactorIn(float inputQuality);
		float GetQualityFactor();
		float GetPurityFactorIn(float inputPurity);
		float GetPurityFactor();
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AddictionComp
	 * Size -> 0x0020 (FullSize[0x0110] - InheritedSize[0x00F0])
	 */
	class UAddictionComp : public UActorComponent
	{
	public:
		bool                                                       autoCleanup;                                             // 0x00F0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_57NV[0x7];                                   // 0x00F1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAddictionMark>                              AddictionData;                                           // 0x00F8(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SFUF[0x8];                                   // 0x0108(0x0008) MISSED OFFSET (PADDING)

	public:
		void StoreSaveData(TArray<float>* targetArray);
		void ResetData();
		void LoadSaveData(TArray<float> sourceArray);
		float GetDataLevel(int32_t substanceIndex, float checkTime);
		void AddData(int32_t newSubstanceIndex, float takeTime, float calcPower, float recoveryTime, float recoveryOffset);
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AirComponent
	 * Size -> 0x0018 (FullSize[0x0108] - InheritedSize[0x00F0])
	 */
	class UAirComponent : public UActorComponent
	{
	public:
		float                                                      airTemp;                                                 // 0x00F0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      airMinTemp;                                              // 0x00F4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      airMaxTemp;                                              // 0x00F8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      rainChance;                                              // 0x00FC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      rainDensity;                                             // 0x0100(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      stormChance;                                             // 0x0104(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AirProfile
	 * Size -> 0x0018 (FullSize[0x0340] - InheritedSize[0x0328])
	 */
	class AAirProfile : public AActor
	{
	public:
		float                                                      airTemp;                                                 // 0x0328(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      airMinTemp;                                              // 0x032C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      airMaxTemp;                                              // 0x0330(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      rainChance;                                              // 0x0334(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      rainDensity;                                             // 0x0338(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      stromChance;                                             // 0x033C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AS_Alkaloid
	 * Size -> 0x0000 (FullSize[0x03E8] - InheritedSize[0x03E8])
	 */
	class AAS_Alkaloid : public AActiveSubstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AS_Amfetamina
	 * Size -> 0x0000 (FullSize[0x03E8] - InheritedSize[0x03E8])
	 */
	class AAS_Amfetamina : public AActiveSubstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AS_Diamorfina
	 * Size -> 0x0000 (FullSize[0x03E8] - InheritedSize[0x03E8])
	 */
	class AAS_Diamorfina : public AActiveSubstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AS_Ergolina
	 * Size -> 0x0000 (FullSize[0x03E8] - InheritedSize[0x03E8])
	 */
	class AAS_Ergolina : public AActiveSubstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AS_MDMA
	 * Size -> 0x0000 (FullSize[0x03E8] - InheritedSize[0x03E8])
	 */
	class AAS_MDMA : public AActiveSubstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AS_Metaamfetamina
	 * Size -> 0x0000 (FullSize[0x03E8] - InheritedSize[0x03E8])
	 */
	class AAS_Metaamfetamina : public AActiveSubstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AS_Piperydyna
	 * Size -> 0x0000 (FullSize[0x03E8] - InheritedSize[0x03E8])
	 */
	class AAS_Piperydyna : public AActiveSubstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AS_Psylocybina
	 * Size -> 0x0000 (FullSize[0x03E8] - InheritedSize[0x03E8])
	 */
	class AAS_Psylocybina : public AActiveSubstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AS_THC
	 * Size -> 0x0000 (FullSize[0x03E8] - InheritedSize[0x03E8])
	 */
	class AAS_THC : public AActiveSubstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AS_THCSativa
	 * Size -> 0x0000 (FullSize[0x03E8] - InheritedSize[0x03E8])
	 */
	class AAS_THCSativa : public AActiveSubstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AS_Tryptamina
	 * Size -> 0x0000 (FullSize[0x03E8] - InheritedSize[0x03E8])
	 */
	class AAS_Tryptamina : public AActiveSubstance
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.AstralProfile
	 * Size -> 0x0018 (FullSize[0x0340] - InheritedSize[0x0328])
	 */
	class AAstralProfile : public AActor
	{
	public:
		float                                                      ligthPower;                                              // 0x0328(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       isEmmitingEnergy;                                        // 0x032C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8GOY[0x3];                                   // 0x032D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      emmitPower;                                              // 0x0330(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      heatEmmitingPerc;                                        // 0x0334(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      orbitToSurfaceAngle;                                     // 0x0338(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      baseDistance;                                            // 0x033C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		float powerOnSurface();
		float heatPower();
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.BU_ManagerActor
	 * Size -> 0x00E8 (FullSize[0x0410] - InheritedSize[0x0328])
	 */
	class ABU_ManagerActor : public AActor
	{
	public:
		class AActor*                                              MainBuildingTargetPtr;                                   // 0x0328(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class ABU_UpgradeLineActor*>                        UpgradeLines;                                            // 0x0330(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TMap<class FString, int32_t>                               SeenUpgrades;                                            // 0x0340(0x0050) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<float>                                              SaveSpace;                                               // 0x0390(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       HasMainLine;                                             // 0x03A0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_XRKU[0x7];                                   // 0x03A1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              MainLineName;                                            // 0x03A8(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ReadyToUse;                                              // 0x03B8(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NHIH[0x7];                                   // 0x03B9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class FString, class ABU_UpgradeLineActor*>           LineNameIndex;                                           // 0x03C0(0x0050) ZeroConstructor, NativeAccessSpecifierPublic

	public:
		void UserSawUpgrades();
		bool UpgradeBought(int32_t NewLevel, const class FString& UpgradeLineName);
		void RefreshBuildingObjects();
		void PrepareDataForUse();
		void LogUnseenDetails(struct FBU_UnseenDetailsSets* LogUnseenDetails);
		void LogUnseenData(const struct FBU_UnseenUL& LogUnseenUL);
		void LogMeOut();
		int32_t GetUnseenData(TArray<struct FBU_UnseenUL>* OutUnseenData);
		int32_t GetMainLineUpgradeLevel();
		void GetAllUpgradeLines(TArray<class ABU_UpgradeLineActor*>* OutReferenceList);
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.BU_UpgradeDetails
	 * Size -> 0x0010 (FullSize[0x0338] - InheritedSize[0x0328])
	 */
	class ABU_UpgradeDetails : public AActor
	{
	public:
		TArray<struct FBU_UpgradeDetailsStruct>                    ChangesSet;                                              // 0x0328(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		int32_t GetMaxUpgradeLevel();
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.BU_UpgradeLineActor
	 * Size -> 0x0040 (FullSize[0x0368] - InheritedSize[0x0328])
	 */
	class ABU_UpgradeLineActor : public AActor
	{
	public:
		int32_t                                                    CurrentLevel;                                            // 0x0328(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    seenMaxLevel;                                            // 0x032C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<float>                                              SaveSpace;                                               // 0x0330(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    MaxLevel;                                                // 0x0340(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       MaxLevelAutoAdaptAfterLoad;                              // 0x0344(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsMainUpgradeLine;                                       // 0x0345(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0TXD[0x2];                                   // 0x0346(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ABU_ManagerActor*                                    BuildingUpgradeManagerPtr;                               // 0x0348(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MainLineLevelRequirement;                                // 0x0350(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OB3H[0x4];                                   // 0x0354(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FBU_ObjectsToDetailsBridge>                  UpgradesSettings;                                        // 0x0358(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		bool UpgradeToLevel(int32_t NewLevel);
		void RefreshDetailsAfterLoad();
		void RefreshDetails();
		void ProcessForLevel(int32_t procLevel);
		float NextUpgradePrice();
		int32_t NextUpgradeLevel();
		bool IsAvailableForUpgrade();
		bool IsAvailable();
		bool HasAllUpgrades();
		float GetUpgradeCost(int32_t procLevel);
		int32_t GetMaxUpgradeLevel();
		float GetLevelPrice(int32_t procLevel);
		void AdaptMaxLevel();
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.CepSaveTester
	 * Size -> 0x0008 (FullSize[0x0330] - InheritedSize[0x0328])
	 */
	class ACepSaveTester : public AActor
	{
	public:
		int32_t                                                    someInt;                                                 // 0x0328(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AI67[0x4];                                   // 0x032C(0x0004) MISSED OFFSET (PADDING)

	public:
		void noticeAction();
		int32_t getCount();
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.CepWeatherComponent
	 * Size -> 0x02E0 (FullSize[0x03D0] - InheritedSize[0x00F0])
	 */
	class UCepWeatherComponent : public UActorComponent
	{
	public:
		int32_t                                                    yearDaysLen;                                             // 0x00F0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Y9MG[0x4];                                   // 0x00F4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USeasonAstralComponent*                              baseAstralSettings;                                      // 0x00F8(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USeasonAstralComponent*                              moonSettings;                                            // 0x0100(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    moonDayHoursLength;                                      // 0x0108(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    moonOrbitDegRot;                                         // 0x010C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class ASeasonProfile*>                              Seasons;                                                 // 0x0110(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		class AWorldTimeAndConditions*                             rootHandler;                                             // 0x0120(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      enablingSunTimeMarginOnToggle;                           // 0x0128(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      sunCeremonyDegMargin;                                    // 0x012C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       inited;                                                  // 0x0130(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QD1N[0x7];                                   // 0x0131(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ATimeProfile*                                        currentTimeInstance;                                     // 0x0138(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    seasonsDefined;                                          // 0x0140(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_851G[0x4];                                   // 0x0144(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<float>                                              sunDataSunrises;                                         // 0x0148(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              sunDataSunsets;                                          // 0x0158(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              sunDataNoons;                                            // 0x0168(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              sunOrbitData;                                            // 0x0178(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              sunOrbitDistanceData;                                    // 0x0188(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonScheme;                                            // 0x0198(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonBasicTemperature;                                  // 0x01A8(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonMinTemperature;                                    // 0x01B8(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonMaxTemperature;                                    // 0x01C8(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonRainChance;                                        // 0x01D8(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonCalcRainChance;                                    // 0x01E8(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonRainDensity;                                       // 0x01F8(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonCloudsDayLogs;                                     // 0x0208(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonStormChance;                                       // 0x0218(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<bool>                                               seasonRainSet;                                           // 0x0228(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<bool>                                               seasonFogSet;                                            // 0x0238(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonRainStartHour;                                     // 0x0248(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonRainEndHour;                                       // 0x0258(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<class UDayConditionsLogger_UE*>                     seasonClouds;                                            // 0x0268(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<class UDayConditionsLogger_UE*>                     seasonRainDetails;                                       // 0x0278(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<class UDayConditionsLogger_UE*>                     seasonHeatProfile;                                       // 0x0288(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<class UDayConditionsLogger_UE*>                     seasonFogLevels;                                         // 0x0298(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonFogDensity;                                        // 0x02A8(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonRainDensityA;                                      // 0x02B8(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonRainDensityB;                                      // 0x02C8(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonStormLength;                                       // 0x02D8(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonStormOffset;                                       // 0x02E8(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		class UObject*                                             tempObject;                                              // 0x02F8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      totalSeasonWage;                                         // 0x0300(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_J3RP[0x4];                                   // 0x0304(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<int32_t>                                            seasonA;                                                 // 0x0308(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<int32_t>                                            seasonB;                                                 // 0x0318(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              impactA;                                                 // 0x0328(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              impactB;                                                 // 0x0338(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              instabilityFactors;                                      // 0x0348(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		int32_t                                                    daysCounter;                                             // 0x0358(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       tempTest;                                                // 0x035C(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_GYW8[0x3];                                   // 0x035D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ASeasonProfile*                                      tempSeasonProfileA;                                      // 0x0360(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class ASeasonProfile*                                      tempSeasonProfileB;                                      // 0x0368(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UAirComponent*                                       tempAirProfileA;                                         // 0x0370(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UAirComponent*                                       tempAirProfileB;                                         // 0x0378(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class USeasonAstralComponent*                              tempSeasonAstralA;                                       // 0x0380(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class USeasonAstralComponent*                              tempSeasonAstralB;                                       // 0x0388(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_UTBC[0x24];                                  // 0x0390(0x0024) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      tempDebProgress;                                         // 0x03B4(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      t1;                                                      // 0x03B8(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      t2;                                                      // 0x03BC(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      t3;                                                      // 0x03C0(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      t4;                                                      // 0x03C4(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      t5;                                                      // 0x03C8(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BVPC[0x4];                                   // 0x03CC(0x0004) MISSED OFFSET (PADDING)

	public:
		float YearPassed();
		int32_t YearDay();
		bool SetupRain(int32_t datNum, float rainLength, float rainDensity);
		void SaveDataSnapshot();
		void RecoverDataSnapshot();
		int32_t NextYearDay(int32_t curDay, int32_t Op);
		void Init();
		static UClass* StaticClass();
	};

	/**
	 * Class DrugDealerSimulator.CepWeatherProfile
	 * Size -> 0x0138 (FullSize[0x0460] - InheritedSize[0x0328])
	 */
	class ACepWeatherProfile : public AActor
	{
	public:
		int32_t                                                    yearDaysLen;                                             // 0x0328(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LB73[0x4];                                   // 0x032C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USeasonAstralComponent*                              baseAstralSettings;                                      // 0x0330(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class ASeasonProfile*>                              Seasons;                                                 // 0x0338(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		class AWorldTimeAndConditions*                             rootHandler;                                             // 0x0348(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       inited;                                                  // 0x0350(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EJBT[0x7];                                   // 0x0351(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ATimeProfile*                                        currentTimeInstance;                                     // 0x0358(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    seasonsDefined;                                          // 0x0360(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_065R[0x4];                                   // 0x0364(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<float>                                              sunDataSunrises;                                         // 0x0368(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              sunDataSunsets;                                          // 0x0378(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonScheme;                                            // 0x0388(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		TArray<float>                                              seasonBasicTemperature;                                  // 0x0398(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
