#pragma once

/**
 * Name: DrugDealerSimulator
 * Version: 1.1.0.25_2022-06-21
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.MergeTakenEffects
	 */
	struct UAbsorbedSubstance_MergeTakenEffects_Params
	{
	public:
		class UAbsorbedSubstance*                                  otherObject;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      curConcentration;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      substanceTolerance;                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.MergeSpiritImpact
	 */
	struct UAbsorbedSubstance_MergeSpiritImpact_Params
	{
	public:
		class UEB_Spirit*                                          Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      takeFactor;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.MergePhysicalImpact
	 */
	struct UAbsorbedSubstance_MergePhysicalImpact_Params
	{
	public:
		class UEB_Physical*                                        Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      takeFactor;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.MergePerceptionImpact
	 */
	struct UAbsorbedSubstance_MergePerceptionImpact_Params
	{
	public:
		class UEB_Perception*                                      Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      takeFactor;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.MergeHealthImpact
	 */
	struct UAbsorbedSubstance_MergeHealthImpact_Params
	{
	public:
		class UEB_BodyHealth*                                      Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      takeFactor;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.MergeBrainFuncsImpact
	 */
	struct UAbsorbedSubstance_MergeBrainFuncsImpact_Params
	{
	public:
		class UEB_BrainFunctions*                                  Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      takeFactor;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.InitFactorHandler
	 */
	struct UAbsorbedSubstance_InitFactorHandler_Params
	{	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.GetQualityFactor
	 */
	struct UAbsorbedSubstance_GetQualityFactor_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.GetPurityFactor
	 */
	struct UAbsorbedSubstance_GetPurityFactor_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.GetFirstPowerMomentTime
	 */
	struct UAbsorbedSubstance_GetFirstPowerMomentTime_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.GetExcretedAmount
	 */
	struct UAbsorbedSubstance_GetExcretedAmount_Params
	{
	public:
		float                                                      checkDayTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.GetDecompositedAmunt
	 */
	struct UAbsorbedSubstance_GetDecompositedAmunt_Params
	{
	public:
		float                                                      checkDayTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.GetCurrentConcentration
	 */
	struct UAbsorbedSubstance_GetCurrentConcentration_Params
	{
	public:
		float                                                      checkDayTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.GetAbsorbedAmunt
	 */
	struct UAbsorbedSubstance_GetAbsorbedAmunt_Params
	{
	public:
		float                                                      checkDayTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.DeepCopySpirit
	 */
	struct UAbsorbedSubstance_DeepCopySpirit_Params
	{
	public:
		class UEB_Spirit*                                          Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.DeepCopyPhysical
	 */
	struct UAbsorbedSubstance_DeepCopyPhysical_Params
	{
	public:
		class UEB_Physical*                                        Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.DeepCopyPerception
	 */
	struct UAbsorbedSubstance_DeepCopyPerception_Params
	{
	public:
		class UEB_Perception*                                      Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.DeepCopyHealth
	 */
	struct UAbsorbedSubstance_DeepCopyHealth_Params
	{
	public:
		class UEB_BodyHealth*                                      Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.DeepCopyBrainFuncs
	 */
	struct UAbsorbedSubstance_DeepCopyBrainFuncs_Params
	{
	public:
		class UEB_BrainFunctions*                                  Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.DeepCopyBaseF
	 */
	struct UAbsorbedSubstance_DeepCopyBaseF_Params
	{
	public:
		class UEB_BaseFactors*                                     Source;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstance.CalcInjection
	 */
	struct UAbsorbedSubstance_CalcInjection_Params
	{
	public:
		class AHumanoidActor*                                      injectedObject;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      checkDayTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.SubstanceHaveExcreted
	 */
	struct UAbsorbedSubstanceComp_SubstanceHaveExcreted_Params
	{
	public:
		float                                                      checkDayTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.StoreSelfData
	 */
	struct UAbsorbedSubstanceComp_StoreSelfData_Params
	{
	public:
		TArray<float>                                              targetArray;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		int32_t                                                    baseOffset;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.RestoreFromData
	 */
	struct UAbsorbedSubstanceComp_RestoreFromData_Params
	{
	public:
		TArray<float>                                              sourceArray;                                             // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		int32_t                                                    baseOffset;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.MergeTakenEffects
	 */
	struct UAbsorbedSubstanceComp_MergeTakenEffects_Params
	{
	public:
		class UAbsorbedSubstanceComp*                              otherObject;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ASubstancesAndEffects*                               handler;                                                 // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      curConcentration;                                        // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      substanceTolerance;                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.MergeSpiritImpact
	 */
	struct UAbsorbedSubstanceComp_MergeSpiritImpact_Params
	{
	public:
		class UEB_Spirit*                                          Source;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ASubstancesAndEffects*                               handler;                                                 // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      takeFactor;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.MergePhysicalImpact
	 */
	struct UAbsorbedSubstanceComp_MergePhysicalImpact_Params
	{
	public:
		class UEB_Physical*                                        Source;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ASubstancesAndEffects*                               handler;                                                 // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      takeFactor;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.MergePerceptionImpact
	 */
	struct UAbsorbedSubstanceComp_MergePerceptionImpact_Params
	{
	public:
		class UEB_Perception*                                      Source;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ASubstancesAndEffects*                               handler;                                                 // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      takeFactor;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.MergeHealthImpact
	 */
	struct UAbsorbedSubstanceComp_MergeHealthImpact_Params
	{
	public:
		class UEB_BodyHealth*                                      Source;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ASubstancesAndEffects*                               handler;                                                 // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      takeFactor;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.MergeBrainFuncsImpact
	 */
	struct UAbsorbedSubstanceComp_MergeBrainFuncsImpact_Params
	{
	public:
		class UEB_BrainFunctions*                                  Source;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ASubstancesAndEffects*                               handler;                                                 // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      takeFactor;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.InitFactorHandler
	 */
	struct UAbsorbedSubstanceComp_InitFactorHandler_Params
	{	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.GetQualityFactor
	 */
	struct UAbsorbedSubstanceComp_GetQualityFactor_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.GetPurityFactor
	 */
	struct UAbsorbedSubstanceComp_GetPurityFactor_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.GetFirstPowerMomentTime
	 */
	struct UAbsorbedSubstanceComp_GetFirstPowerMomentTime_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.GetExcretedAmount
	 */
	struct UAbsorbedSubstanceComp_GetExcretedAmount_Params
	{
	public:
		float                                                      checkDayTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.GetDecompositedAmount
	 */
	struct UAbsorbedSubstanceComp_GetDecompositedAmount_Params
	{
	public:
		float                                                      checkDayTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.GetCurrentConcentration
	 */
	struct UAbsorbedSubstanceComp_GetCurrentConcentration_Params
	{
	public:
		float                                                      checkDayTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.GetAbsorbedAmunt
	 */
	struct UAbsorbedSubstanceComp_GetAbsorbedAmunt_Params
	{
	public:
		float                                                      checkDayTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.DeepCopySpirit
	 */
	struct UAbsorbedSubstanceComp_DeepCopySpirit_Params
	{
	public:
		class UEB_Spirit*                                          Source;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.DeepCopyPhysical
	 */
	struct UAbsorbedSubstanceComp_DeepCopyPhysical_Params
	{
	public:
		class UEB_Physical*                                        Source;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.DeepCopyPerception
	 */
	struct UAbsorbedSubstanceComp_DeepCopyPerception_Params
	{
	public:
		class UEB_Perception*                                      Source;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.DeepCopyHealth
	 */
	struct UAbsorbedSubstanceComp_DeepCopyHealth_Params
	{
	public:
		class UEB_BodyHealth*                                      Source;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.DeepCopyBrainFuncs
	 */
	struct UAbsorbedSubstanceComp_DeepCopyBrainFuncs_Params
	{
	public:
		class UEB_BrainFunctions*                                  Source;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.DeepCopyBaseF
	 */
	struct UAbsorbedSubstanceComp_DeepCopyBaseF_Params
	{
	public:
		class UEB_BaseFactors*                                     Source;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AbsorbedSubstanceComp.CalcInjection
	 */
	struct UAbsorbedSubstanceComp_CalcInjection_Params
	{
	public:
		class AHumanoidActor*                                      injectedObject;                                          // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      checkDayTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.ActiveSubstance.GetQualityFactorIn
	 */
	struct AActiveSubstance_GetQualityFactorIn_Params
	{
	public:
		float                                                      inputQuality;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.ActiveSubstance.GetQualityFactor
	 */
	struct AActiveSubstance_GetQualityFactor_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.ActiveSubstance.GetPurityFactorIn
	 */
	struct AActiveSubstance_GetPurityFactorIn_Params
	{
	public:
		float                                                      inputPurity;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.ActiveSubstance.GetPurityFactor
	 */
	struct AActiveSubstance_GetPurityFactor_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AddictionComp.StoreSaveData
	 */
	struct UAddictionComp_StoreSaveData_Params
	{
	public:
		TArray<float>                                              targetArray;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AddictionComp.ResetData
	 */
	struct UAddictionComp_ResetData_Params
	{	};

	/**
	 * Function DrugDealerSimulator.AddictionComp.LoadSaveData
	 */
	struct UAddictionComp_LoadSaveData_Params
	{
	public:
		TArray<float>                                              sourceArray;                                             // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AddictionComp.GetDataLevel
	 */
	struct UAddictionComp_GetDataLevel_Params
	{
	public:
		int32_t                                                    substanceIndex;                                          // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      checkTime;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AddictionComp.AddData
	 */
	struct UAddictionComp_AddData_Params
	{
	public:
		int32_t                                                    newSubstanceIndex;                                       // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      takeTime;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      calcPower;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      recoveryTime;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      recoveryOffset;                                          // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AstralProfile.powerOnSurface
	 */
	struct AAstralProfile_powerOnSurface_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.AstralProfile.heatPower
	 */
	struct AAstralProfile_heatPower_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_ManagerActor.UserSawUpgrades
	 */
	struct ABU_ManagerActor_UserSawUpgrades_Params
	{	};

	/**
	 * Function DrugDealerSimulator.BU_ManagerActor.UpgradeBought
	 */
	struct ABU_ManagerActor_UpgradeBought_Params
	{
	public:
		int32_t                                                    NewLevel;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              UpgradeLineName;                                         // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_ManagerActor.RefreshBuildingObjects
	 */
	struct ABU_ManagerActor_RefreshBuildingObjects_Params
	{	};

	/**
	 * Function DrugDealerSimulator.BU_ManagerActor.PrepareDataForUse
	 */
	struct ABU_ManagerActor_PrepareDataForUse_Params
	{	};

	/**
	 * Function DrugDealerSimulator.BU_ManagerActor.LogUnseenDetails
	 */
	struct ABU_ManagerActor_LogUnseenDetails_Params
	{
	public:
		struct FBU_UnseenDetailsSets                               LogUnseenDetails;                                        // 0x0000(0x0018)  (Parm, OutParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_ManagerActor.LogUnseenData
	 */
	struct ABU_ManagerActor_LogUnseenData_Params
	{
	public:
		struct FBU_UnseenUL                                        LogUnseenUL;                                             // 0x0000(0x0020)  (ConstParm, Parm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_ManagerActor.LogMeOut
	 */
	struct ABU_ManagerActor_LogMeOut_Params
	{	};

	/**
	 * Function DrugDealerSimulator.BU_ManagerActor.GetUnseenData
	 */
	struct ABU_ManagerActor_GetUnseenData_Params
	{
	public:
		TArray<struct FBU_UnseenUL>                                OutUnseenData;                                           // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_ManagerActor.GetMainLineUpgradeLevel
	 */
	struct ABU_ManagerActor_GetMainLineUpgradeLevel_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_ManagerActor.GetAllUpgradeLines
	 */
	struct ABU_ManagerActor_GetAllUpgradeLines_Params
	{
	public:
		TArray<class ABU_UpgradeLineActor*>                        OutReferenceList;                                        // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeDetails.GetMaxUpgradeLevel
	 */
	struct ABU_UpgradeDetails_GetMaxUpgradeLevel_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.UpgradeToLevel
	 */
	struct ABU_UpgradeLineActor_UpgradeToLevel_Params
	{
	public:
		int32_t                                                    NewLevel;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.RefreshDetailsAfterLoad
	 */
	struct ABU_UpgradeLineActor_RefreshDetailsAfterLoad_Params
	{	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.RefreshDetails
	 */
	struct ABU_UpgradeLineActor_RefreshDetails_Params
	{	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.ProcessForLevel
	 */
	struct ABU_UpgradeLineActor_ProcessForLevel_Params
	{
	public:
		int32_t                                                    procLevel;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.NextUpgradePrice
	 */
	struct ABU_UpgradeLineActor_NextUpgradePrice_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.NextUpgradeLevel
	 */
	struct ABU_UpgradeLineActor_NextUpgradeLevel_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.IsAvailableForUpgrade
	 */
	struct ABU_UpgradeLineActor_IsAvailableForUpgrade_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.IsAvailable
	 */
	struct ABU_UpgradeLineActor_IsAvailable_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.HasAllUpgrades
	 */
	struct ABU_UpgradeLineActor_HasAllUpgrades_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.GetUpgradeCost
	 */
	struct ABU_UpgradeLineActor_GetUpgradeCost_Params
	{
	public:
		int32_t                                                    procLevel;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.GetMaxUpgradeLevel
	 */
	struct ABU_UpgradeLineActor_GetMaxUpgradeLevel_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.GetLevelPrice
	 */
	struct ABU_UpgradeLineActor_GetLevelPrice_Params
	{
	public:
		int32_t                                                    procLevel;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.BU_UpgradeLineActor.AdaptMaxLevel
	 */
	struct ABU_UpgradeLineActor_AdaptMaxLevel_Params
	{	};

	/**
	 * Function DrugDealerSimulator.CepSaveTester.noticeAction
	 */
	struct ACepSaveTester_noticeAction_Params
	{	};

	/**
	 * Function DrugDealerSimulator.CepSaveTester.getCount
	 */
	struct ACepSaveTester_getCount_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.CepWeatherComponent.YearPassed
	 */
	struct UCepWeatherComponent_YearPassed_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.CepWeatherComponent.YearDay
	 */
	struct UCepWeatherComponent_YearDay_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.CepWeatherComponent.SetupRain
	 */
	struct UCepWeatherComponent_SetupRain_Params
	{
	public:
		int32_t                                                    datNum;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      rainLength;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      rainDensity;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.CepWeatherComponent.SaveDataSnapshot
	 */
	struct UCepWeatherComponent_SaveDataSnapshot_Params
	{	};

	/**
	 * Function DrugDealerSimulator.CepWeatherComponent.RecoverDataSnapshot
	 */
	struct UCepWeatherComponent_RecoverDataSnapshot_Params
	{	};

	/**
	 * Function DrugDealerSimulator.CepWeatherComponent.NextYearDay
	 */
	struct UCepWeatherComponent_NextYearDay_Params
	{
	public:
		int32_t                                                    curDay;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Op;                                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.CepWeatherComponent.Init
	 */
	struct UCepWeatherComponent_Init_Params
	{	};

	/**
	 * Function DrugDealerSimulator.CepWeatherProfile.YearPassed
	 */
	struct ACepWeatherProfile_YearPassed_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.CepWeatherProfile.YearDay
	 */
	struct ACepWeatherProfile_YearDay_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.CepWeatherProfile.Init
	 */
	struct ACepWeatherProfile_Init_Params
	{	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLogger_UE.StartCommitSession
	 */
	struct UDayConditionsLogger_UE_StartCommitSession_Params
	{
	public:
		float                                                      newStartVal;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLogger_UE.SetValueByIndex
	 */
	struct UDayConditionsLogger_UE_SetValueByIndex_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      NewValue;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLogger_UE.SetValueByHour
	 */
	struct UDayConditionsLogger_UE_SetValueByHour_Params
	{
	public:
		float                                                      setHour;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      NewValue;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLogger_UE.SeekIndex
	 */
	struct UDayConditionsLogger_UE_SeekIndex_Params
	{
	public:
		float                                                      seekHour;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLogger_UE.IsInCommitMode
	 */
	struct UDayConditionsLogger_UE_IsInCommitMode_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLogger_UE.GetValuesLength
	 */
	struct UDayConditionsLogger_UE_GetValuesLength_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLogger_UE.GetValueByIndex
	 */
	struct UDayConditionsLogger_UE_GetValueByIndex_Params
	{
	public:
		int32_t                                                    SeekIndex;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLogger_UE.GetValueByHour
	 */
	struct UDayConditionsLogger_UE_GetValueByHour_Params
	{
	public:
		float                                                      seekHour;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       extrapolateValue;                                        // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLogger_UE.GetSum
	 */
	struct UDayConditionsLogger_UE_GetSum_Params
	{
	public:
		int32_t                                                    maxIndex;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLogger_UE.GetNextIndex
	 */
	struct UDayConditionsLogger_UE_GetNextIndex_Params
	{
	public:
		int32_t                                                    curIndex;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Op;                                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLogger_UE.EndCommitSession
	 */
	struct UDayConditionsLogger_UE_EndCommitSession_Params
	{
	public:
		float                                                      newEndVal;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       followToEnd;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLogger_UE.ClassInit
	 */
	struct UDayConditionsLogger_UE_ClassInit_Params
	{	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLoggerComponent.SetValueByIndex
	 */
	struct UDayConditionsLoggerComponent_SetValueByIndex_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      NewValue;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.DayConditionsLoggerComponent.Init
	 */
	struct UDayConditionsLoggerComponent_Init_Params
	{	};

	/**
	 * Function DrugDealerSimulator.EB_BaseFactors.StoreSelfData
	 */
	struct UEB_BaseFactors_StoreSelfData_Params
	{
	public:
		TArray<float>                                              targetArray;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		int32_t                                                    baseOffset;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.EB_BaseFactors.SetClassBasics
	 */
	struct UEB_BaseFactors_SetClassBasics_Params
	{	};

	/**
	 * Function DrugDealerSimulator.EB_BaseFactors.RestoreFromData
	 */
	struct UEB_BaseFactors_RestoreFromData_Params
	{
	public:
		TArray<float>                                              sourceArray;                                             // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		int32_t                                                    baseOffset;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.EB_BaseFactors.GetAddictivnessFactor
	 */
	struct UEB_BaseFactors_GetAddictivnessFactor_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.EB_BodyHealth.StoreSelfData
	 */
	struct UEB_BodyHealth_StoreSelfData_Params
	{
	public:
		TArray<float>                                              targetArray;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		int32_t                                                    baseOffset;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.EB_BodyHealth.SetClassBasics
	 */
	struct UEB_BodyHealth_SetClassBasics_Params
	{	};

	/**
	 * Function DrugDealerSimulator.EB_BodyHealth.RestoreFromData
	 */
	struct UEB_BodyHealth_RestoreFromData_Params
	{
	public:
		TArray<float>                                              sourceArray;                                             // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		int32_t                                                    baseOffset;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.EB_BodyHealth.InitAsValuesStorage
	 */
	struct UEB_BodyHealth_InitAsValuesStorage_Params
	{	};

	/**
	 * Function DrugDealerSimulator.EB_BodyHealth.InitAsMinClamp
	 */
	struct UEB_BodyHealth_InitAsMinClamp_Params
	{	};

	/**
	 * Function DrugDealerSimulator.EB_BodyHealth.InitAsMaxClamp
	 */
	struct UEB_BodyHealth_InitAsMaxClamp_Params
	{	};

	/**
	 * Function DrugDealerSimulator.EB_BodyHealth.InitAsFactor
	 */
	struct UEB_BodyHealth_InitAsFactor_Params
	{	};

	/**
	 * Function DrugDealerSimulator.EB_BrainFunctions.StoreSelfData
	 */
	struct UEB_BrainFunctions_StoreSelfData_Params
	{
	public:
		TArray<float>                                              targetArray;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
		int32_t                                                    baseOffset;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.EB_BrainFunctions.SetClassBasics
	 */
	struct UEB_BrainFunctions_SetClassBasics_Params
	{	};

	/**
	 * Function DrugDealerSimulator.EB_BrainFunctions.RestoreFromData
	 */
	struct UEB_BrainFunctions_RestoreFromData_Params
	{
	public:
		TArray<float>                                              sourceArray;                                             // 0x0000(0x0010)  (ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		int32_t                                                    baseOffset;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function DrugDealerSimulator.EB_BrainFunctions.InitAsValuesStorage
	 */
	struct UEB_BrainFunctions_InitAsValuesStorage_Params
	{	};

	/**
	 * Function DrugDealerSimulator.EB_BrainFunctions.InitAsMinClamp
	 */
	struct UEB_BrainFunctions_InitAsMinClamp_Params
	{	};

	/**
	 * Function DrugDealerSimulator.EB_BrainFunctions.InitAsMaxClamp
	 */
	struct UEB_BrainFunctions_InitAsMaxClamp_Params
	{	};

	/**
	 * Function DrugDealerSimulator.EB_BrainFunctions.InitAsFactor
	 */
