#pragma once

/**
 * Name: DrugDealerSimulator
 * Version: 1.1.0.25_2022-06-21
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function saleAreaManagementWidget.saleAreaManagementWidget_C.markerSetAreaVisuals
	 */
	struct UsaleAreaManagementWidget_C_markerSetAreaVisuals_Params
	{
	public:
		float                                                      BorderOpacity;                                           // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FSlateColor                                         BorderColor;                                             // 0x0000(0x0028)  (BlueprintVisible, BlueprintReadOnly, Parm)
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function saleAreaManagementWidget.saleAreaManagementWidget_C.markerHoverAction
	 */
	struct UsaleAreaManagementWidget_C_markerHoverAction_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UTexture2D*                                          Image;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function saleAreaManagementWidget.saleAreaManagementWidget_C.Construct
	 */
	struct UsaleAreaManagementWidget_C_Construct_Params
	{	};

	/**
	 * Function saleAreaManagementWidget.saleAreaManagementWidget_C.BndEvt__btnChangeSpray_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UsaleAreaManagementWidget_C_BndEvt__btnChangeSpray_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function saleAreaManagementWidget.saleAreaManagementWidget_C.Destruct
	 */
	struct UsaleAreaManagementWidget_C_Destruct_Params
	{	};

	/**
	 * Function saleAreaManagementWidget.saleAreaManagementWidget_C.ExecuteUbergraph_saleAreaManagementWidget
	 */
	struct UsaleAreaManagementWidget_C_ExecuteUbergraph_saleAreaManagementWidget_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
