#pragma once

// Name: DDS, Version: 2020.4.30

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct clientLooksData.clientLooksData
// 0x0014
struct FclientLooksData
{
	int                                                mainBodyID_2_46F1DC474B6E35DF2EC64799A3208BDF;            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                headSkinVersion_11_4B27153E49BC8FCEF2421BBDA17666AB;      // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                hairID_13_5BFC6B6F4C189721CA0E918028FC1466;               // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                hatID_14_8232122F47A15227EABCEF8079DA56B8;                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                glassesID_17_E513851E4C7B808151DA00B7DE2DEECB;            // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
