#pragma once

// Name: DDS, Version: 2020.10.2

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Crow_AnimBlueprint.Crow_AnimBlueprint_C
// 0x1818 (0x1B78 - 0x0360)
class UCrow_AnimBlueprint_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_8F0D02EA456F849A47FEA6B305F9D73D;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_641CD3DF4F254514645562BC523DB6A4;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C945845A4B875F7325A6D984FD0B5252;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_74393ACE4FD295AE2DD520B18BBB5636;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE8993D647DC38E942060C8299AC737B;// 0x0480(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A82DBF91434212BFF04A02A4482D8301;// 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9D9B9D614DB8168B1CAD3D8763A93038;// 0x0510(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4E5AD16B48AFB48A969BC69B0E7EEB0D;// 0x0558(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_49723B884FAEF951605893BDD9892229;// 0x05A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2286937548DE68F55388A3AC02C2969A;// 0x05E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A99FE15A4CFC0F3D1C3D37BC96E8D82F;// 0x0630(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C593C8CB4255F8A7C03514BD2C9CE749;// 0x0678(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D7D3B33047D542753F3CF188051AE1C7;// 0x06C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FB1EAAE7421F6495D37BA3BEA1053A5A;// 0x0708(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE006F25474E0F4C36AE49BE2D940CEF;// 0x0750(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1BE51BF344831A76A0E5BFA32807A45B;// 0x0798(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_61B8816F40EF7A99C6FA1AB86B0C01AE;// 0x0838(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A4E33C34533FCD36EFE5BA9CDCC3ACD;// 0x0878(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_84E0E7834D38983120C6D59A74BC5B03;// 0x0918(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_39FA56F348CFA6B33E4A97A414B4692C;// 0x09B8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_27F57DE24566AD0F43C40194DD72BF60;// 0x0A58(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C8212901433FC649697855B63662DEFC;// 0x0AF8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_01BDC7DE4B0B6078873E27BDD21F7BF9;// 0x0B98(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_301B9094427BF7BF7BE5D8B0C21F40DC;// 0x0C38(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_16535E5F496B8269DC9E818D7EF30FC2;// 0x0CD8(0x00A0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_4538200D48041B6AC28C66A93C62DF57;// 0x0D78(0x00D0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_BC230F4A45AB3E80C2329E81220C3563;// 0x0E48(0x00D0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4750676240BC9E899D10B294EA8BE051;// 0x0F18(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F71C8A254609A92007DB859392EBF7D8;// 0x0F58(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A333D56A4BF87A034601AEA90C100975;// 0x0FF8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_537891204F7C45FD291D6DBA911B4941;// 0x1038(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D4AD251641E13BC4935696AE7F47B2F5;// 0x10D8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1442EE584892D6AB7AE3DCAB065DF092;// 0x1178(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_684F00B747BC44D24836DF83EF213A0E;// 0x1218(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_889CF55D4D8142163BB5EFA448F522C4;// 0x12B8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3960CB1D4A92FC2848DBC98BD0868AE4;// 0x1358(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AAB6A36B4E1DF7A3D086EB973B349E76;// 0x13F8(0x00A0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_35571321436D7BBF90F2F9B4F43F74C6;// 0x1498(0x00D0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_56321F0C4C104077834A5B958A7F5966;// 0x1568(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EF12856946780B3110BF438F72F91CBC;// 0x15A8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6288CF414C0D9824EA7A0796A10EA0B2;// 0x1648(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9FF97C1745008E1C300A1F9960D90602;// 0x16E8(0x00D0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4126E4A44D14CC9D7CBD718406F32C7D;// 0x17B8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8EC466454212F9B5C989E4BBBF6E90F1;// 0x17F8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_551970A143C2CA7D09FB79A640F4A00B;// 0x1898(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7C5EBA9643FB8B965A1257B37944E0FC;// 0x18D8(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_20764777451AEB88D2BA87A7A1D29D7B;// 0x1A00(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_AA283DF64DD0CB7E8F96A2B684CD16DA;// 0x1A40(0x00E0)
	bool                                               FlyUp_;                                                   // 0x1B20(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FlyUpFast_;                                               // 0x1B21(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x1B22(0x0002) MISSED OFFSET
	float                                              Direction;                                                // 0x1B24(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Flying_Speed;                                             // 0x1B28(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Walking_Speed;                                            // 0x1B2C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FlyToPerch_;                                              // 0x1B30(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AreWeFlying_;                                             // 0x1B31(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AreWeWalking_;                                            // 0x1B32(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsInAir_;                                                 // 0x1B33(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FlapFast_;                                                // 0x1B34(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x1B35(0x0003) MISSED OFFSET
	float                                              DistanceToGround;                                         // 0x1B38(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayIdleLoop_;                                            // 0x1B3C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x1B3D(0x0003) MISSED OFFSET
	int                                                RandomIdleAnimation;                                      // 0x1B40(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayTakeOffAnimation_;                                    // 0x1B44(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AreWePerched_;                                            // 0x1B45(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LandOnPerch_;                                             // 0x1B46(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x1];                                       // 0x1B47(0x0001) MISSED OFFSET
	struct FName                                       BBKey_AreWeFlying_;                                       // 0x1B48(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_AreWePerched_;                                      // 0x1B50(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_AreWeWalking_;                                      // 0x1B58(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_DistanceToTheGround;                                // 0x1B60(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_FlapFast_;                                          // 0x1B68(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_FlyToPerch_;                                        // 0x1B70(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Crow_AnimBlueprint.Crow_AnimBlueprint_C");
		return ptr;
	}


	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_IdleEnd();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Crow_AnimBlueprint_AnimGraphNode_BlendListByInt_4538200D48041B6AC28C66A93C62DF57();
	void ExecuteUbergraph_Crow_AnimBlueprint(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
