#pragma once

// Name: DDS, Version: 2020.4.21

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass laBallenaAnimBP.laBallenaAnimBP_C
// 0x0F50 (0x12B0 - 0x0360)
class UlaBallenaAnimBP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_AED2318B437D98A8644616973BF73A82;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F31A3814598392B47B5968856A21AFD;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17393D19411834F24AB3AAA2B8433839;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0738F7BF45AB33157ED57D82D35A7055;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C9DE14644156C662C9285A931BCA12C;// 0x0480(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_284C9B504D45FAF586A34DA047EA5BEC;// 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E7D525214F10876F6E58E09B67C47F21;// 0x0510(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_037A3DCA49068868159C2B81677A2F31;// 0x0558(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3BBD3452416960408D41FEBF37E2E686;// 0x05A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F9D9B9BD40032349DADD3D87E2D55145;// 0x05E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D92D16394AE10A3C0A2CD1A05DB1B8B6;// 0x0630(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CA75825C4BB03EA0C5FBB4ADCCE191F4;// 0x0678(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FFAE29C94910BC05F461AB84CE482F95;// 0x06C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5776D2BD4E34227A522D358C2DA95B8C;// 0x0708(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2964F27141F6254D0E566699173E3189;// 0x0750(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2484EE824784A22A4EE77683FE19159A;// 0x0798(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BF2EC669466E28F37AC31E9E895DA210;// 0x07E0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F3E45ACC472C040239693287868F83BE;// 0x0828(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_701E069B45DDEBA524569D92B1AC9D5B;// 0x08C8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4EBA6C7546904D05F598629564356C0F;// 0x0908(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_455C161046BEBB94029379837F220558;// 0x09A8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1CFDEABD40AF8DEB4CC6D49EF0653B8F;// 0x09E8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_07D0873042D09919CDE926A71DA9CC8D;// 0x0A88(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0A93FCD2458CDEE73B5EC28369F4960B;// 0x0AC8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CB758089476E8CFC67841D8C9C2A2687;// 0x0B68(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A8CF70214FFA1E9350AF98875307E00B;// 0x0BA8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_484320AE4ABB63FD58DD649C12BC4FA4;// 0x0C48(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7676DB274EA39FE620D574BE1D5A9FF7;// 0x0C88(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_67E45FB94E7A2320857D16A8C121672C;// 0x0D28(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B4CB059240025388222C1D84114F91DF;// 0x0D68(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5A3BF7CE4DBA0E03B236CBA0C445E16B;// 0x0E08(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10B557834D1A80D5112DDA8F6D67F178;// 0x0E48(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_EC92429E4C3053EA8166338A75FB17ED;// 0x0EE8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A5A3799244E97C99192AAB86216A8494;// 0x0F28(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DA935F234BE5EAC6BD37C5BAAAF1D79C;// 0x0FC8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ACE448E14495FD2CE7DC83B7587DEEF9;// 0x1008(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_42090658433D46932DC4678454D1DD6D;// 0x10A8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DBC9EA794645D69A4CAD319A6F71279B;// 0x10E8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BB93A660479B5EE87EE693A3D287089C;// 0x1188(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0D7940794BE7B4BCD15E609B7D68943A;// 0x11C8(0x00E0)
	bool                                               startWelcome;                                             // 0x12A8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               startSitDown;                                             // 0x12A9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               startBrief;                                               // 0x12AA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               straightPoint;                                            // 0x12AB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               whatWant;                                                 // 0x12AC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               closer;                                                   // 0x12AD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               playerNotSure;                                            // 0x12AE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               playerConfirm;                                            // 0x12AF(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass laBallenaAnimBP.laBallenaAnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_laBallenaAnimBP_AnimGraphNode_TransitionResult_F9D9B9BD40032349DADD3D87E2D55145();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_laBallenaAnimBP_AnimGraphNode_TransitionResult_D92D16394AE10A3C0A2CD1A05DB1B8B6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_laBallenaAnimBP_AnimGraphNode_TransitionResult_E7D525214F10876F6E58E09B67C47F21();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_laBallenaAnimBP_AnimGraphNode_TransitionResult_3BBD3452416960408D41FEBF37E2E686();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_laBallenaAnimBP_AnimGraphNode_TransitionResult_0738F7BF45AB33157ED57D82D35A7055();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_laBallenaAnimBP_AnimGraphNode_TransitionResult_17393D19411834F24AB3AAA2B8433839();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_laBallenaAnimBP_AnimGraphNode_TransitionResult_7F31A3814598392B47B5968856A21AFD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_laBallenaAnimBP_AnimGraphNode_TransitionResult_037A3DCA49068868159C2B81677A2F31();
	void ExecuteUbergraph_laBallenaAnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
