#pragma once

// Name: DDS, Version: 2020.9.30

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Pigeon_AnimBlueprint.Pigeon_AnimBlueprint_C
// 0x1178 (0x14D8 - 0x0360)
class UPigeon_AnimBlueprint_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_F03A09464F3FD0A94761F3A66D20CBE1;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B811327A40C97850503D67925CBED9EA;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3489454D40018920F14C9995BB675B0A;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BF4EEDD046D39D41C9EE01A3BC293D6C;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E6BE0C2642A80D5F2F858CAECCEC4D7B;// 0x0480(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B9D8000F49CFC819B092C197009145DC;// 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_427E5F8241D7061608CC2D87C103A468;// 0x0510(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BDC7EFFC485A459F7E4175843D9D3F95;// 0x0558(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43E17F0E465894818F71E3A76919CC40;// 0x05A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_653388304198BFDACF6587944C219E1D;// 0x05E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CB901D414CCDAFAD7363EFBF5ECB60B8;// 0x0630(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1B5E09ED46A8111D58381A99FF2B4710;// 0x0678(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_02743A4C43C54F1A23F08C9707D12525;// 0x06C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DFAB854F4742B324EAE88CBA4AA760FC;// 0x0708(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32E59B054B9E00E8312E3C92B27F9764;// 0x0750(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_54B6A55F419F91346A4EE28E792546B6;// 0x0798(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3672BA7F4DBCD55B445693864E0A03A4;// 0x0838(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_58F1A0454B459C6A9AEE5C84CE5EBABB;// 0x08D8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7FC693D648FEC2204D30E3B85CE7D4AE;// 0x0978(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_691F2AF74802C39E570717876102BFB3;// 0x0A18(0x00A0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_2816D29543E117DFB713C5A3C664C5DC;// 0x0AB8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_98CB820147E3648D7AD876A9DA9C9E70;// 0x0B88(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2291FA604F4698FCB7E68098B2A4CB30;// 0x0C28(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C25330BC44D37B04F51233B3C65B6188;// 0x0C68(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_97E3B41843A56187C6FF0694B8534C95;// 0x0D90(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_957D357D46933D3BBE94BB8A238EFE97;// 0x0DD0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_089DB1954505B00284EA85A58D58E214;// 0x0E70(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9EB1BF204866806461C4208A180F1ACE;// 0x0EB0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_EF32214F455C189A07160AA2B5AEF488;// 0x0F50(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5CED78294A437F474E2FDEADE0EF9A4F;// 0x0F90(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_761F01914A0080B3E0552C97F9B059B8;// 0x1030(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AE0CA43743E9404C75E22F83C8650F2D;// 0x1070(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F261B1D74EF6EC8DDF7796BE60612F15;// 0x1110(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5BF18CEF4991A63561A84487AE887811;// 0x1150(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B6046F34CA189C27E0FFDBA4F930459;// 0x1220(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AA79D8C84ED63100A83A0099DDD03BE4;// 0x12C0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_66C8FF5442E14B6AED0693B1E06FEE53;// 0x1360(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_1F9ECC564468F446B644A2925774B584;// 0x13A0(0x00E0)
	float                                              Direction;                                                // 0x1480(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Flying_Speed;                                             // 0x1484(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Walking_Speed;                                            // 0x1488(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AreWeFlying_;                                             // 0x148C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AreWeWalking_;                                            // 0x148D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsInAir_;                                                 // 0x148E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FlapFast_;                                                // 0x148F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DistanceToGround;                                         // 0x1490(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayIdleLoop_;                                            // 0x1494(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x1495(0x0003) MISSED OFFSET
	int                                                RandomIdleAnimation;                                      // 0x1498(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayTakeOffAnimation_;                                    // 0x149C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AreWePerched_;                                            // 0x149D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LandOnPerch_;                                             // 0x149E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x149F(0x0001) MISSED OFFSET
	struct FName                                       BBKey_AreWeFlying_;                                       // 0x14A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_AreWePerched_;                                      // 0x14A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_AreWeWalking_;                                      // 0x14B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_DistanceToTheGround;                                // 0x14B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FlyToPerch_;                                              // 0x14C0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x14C1(0x0007) MISSED OFFSET
	struct FName                                       BBKey_FlyToPerch_;                                        // 0x14C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_FlyAway_;                                           // 0x14D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Pigeon_AnimBlueprint.Pigeon_AnimBlueprint_C");
		return ptr;
	}


	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_IdleEnd();
	void ExecuteUbergraph_Pigeon_AnimBlueprint(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
