#pragma once

// Name: DDS, Version: 2020.9.30

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Seagull_AnimationBlueprint.Seagull_AnimationBlueprint_C
// 0x17B8 (0x1B18 - 0x0360)
class USeagull_AnimationBlueprint_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_43C3796E4F6C720A0D48718B81E8D449;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E70F621F48CC434FD5A948ACA62827F9;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5BDDAE6A40B3752BFFE422AE0CD642C7;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DD2124D5451E8FEF69E6C0B2DA571F4E;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7E2D553E48B3CAF2704DFFBA43A4B67E;// 0x0480(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E4F4723F4662E410E0BB9DB10104210B;// 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E412BDCB404144188E65ECA3ED87398C;// 0x0510(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_373D43DC449FC143837D25A62F5F6F31;// 0x0558(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FA6E0766455A11F6BA6D54B6CB0D812F;// 0x05A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D195B1FF4E4E726BBFEBF5BA1DF7A0F8;// 0x05E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0312F45046AD8C0C3BA17BB31C935E73;// 0x0630(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_843E7F5447AE44349A896F99E3376E09;// 0x0678(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D3951D6B4F3948CA09635ABA693A5B09;// 0x06C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_89E340014CAB49713E19C6A16ACCB63C;// 0x0708(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_81AF364A48A9BD8042F359ACFE73342B;// 0x0750(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_91CA87FB48F51E6C6F493B9BBFE02F70;// 0x07F0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5491A60C47D1EC67B8426E860D6ADEA6;// 0x0830(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B92AF0D5480CE2A36AC6859321BA7FB6;// 0x08D0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0F6853E247409F17B081418625AD5437;// 0x0910(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_35BE5C9241993779911D4C8DD2D8B1A6;// 0x09B0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CB0DEE46491E834CCEA6A892B55894FE;// 0x0A50(0x00A0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_85473F0A4FD880EC4878C4AE83C6B14A;// 0x0AF0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_715A0E8F4C21D0C7728DA2AC621A39F0;// 0x0BC0(0x00A0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_71FB2BCD4A4A1EFB00CB0FA6B4059A32;// 0x0C60(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B9617A24966503DC4A0D6A3AF6A8DD9;// 0x0D30(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F111CBC3469DB8416691CD8391050117;// 0x0DD0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_164CC0A8475B50D4CF440AA5242390D6;// 0x0E70(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5FFB6BF94BB2C8C3AD4DB59BA9F38840;// 0x0F10(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D0B2F74D4D0ECB2D5200E39C89CE2A53;// 0x0FB0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F3A87D104CF10F7E0F7FF7A3C4CDE8BA;// 0x0FF0(0x00A0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_262551824691B2B57EC8E9B9B4EBA883;// 0x1090(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_20E1266D44ED5BB48D9391BE2D1E68B9;// 0x1160(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_291B709B477331FEA8B845B105BD8D39;// 0x1200(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F43DA23648CD3D077FA31D9937720C5E;// 0x12A0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A493079445CF4A8F8FDEB4A272F089C4;// 0x1340(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D7569EED45D8D0BE8B060087B8CFC0FA;// 0x13E0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E882AE1040C1AEA29DC6CFBCC90E17C6;// 0x1480(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D066F6FE41184EEFD6881E82D49A0A39;// 0x14C0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A0F1248B43E7021CFCFA478076E88897;// 0x1560(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DBF078EB4B43B00BC1BE73B3F13854CB;// 0x1600(0x00D0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D78527D144D13D352703869EF209D199;// 0x16D0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_28C72F17487329A00C12029C49E3D372;// 0x1710(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7A1AAB0E4E0F3BC56DC70D99F1576C49;// 0x1838(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1F31BB4A48775FC8BE03D286BA1FBC46;// 0x1878(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9C50BFF54EDEFC3DB758B0BD54CA1B7C;// 0x19A0(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_94949B0245EB8ADF1B2BA3925C3E996F;// 0x19E0(0x00E0)
	float                                              Direction;                                                // 0x1AC0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Flying_Speed;                                             // 0x1AC4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Walking_Speed;                                            // 0x1AC8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AreWeFlying_;                                             // 0x1ACC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AreWeWalking_;                                            // 0x1ACD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsInAir_;                                                 // 0x1ACE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FlapFast_;                                                // 0x1ACF(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DistanceToGround;                                         // 0x1AD0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayIdleLoop_;                                            // 0x1AD4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x1AD5(0x0003) MISSED OFFSET
	int                                                RandomIdleAnimation;                                      // 0x1AD8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayTakeOffAnimation_;                                    // 0x1ADC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AreWePerched_;                                            // 0x1ADD(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LandOnPerch_;                                             // 0x1ADE(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x1ADF(0x0001) MISSED OFFSET
	struct FName                                       BBKey_AreWeFlying_;                                       // 0x1AE0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_AreWePerched_;                                      // 0x1AE8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_AreWeWalking_;                                      // 0x1AF0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_DistanceToTheGround;                                // 0x1AF8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       BBKey_FlapFast_;                                          // 0x1B00(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FlyToPerch_;                                              // 0x1B08(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x1B09(0x0007) MISSED OFFSET
	struct FName                                       BBKey_FlyToPerch_;                                        // 0x1B10(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Seagull_AnimationBlueprint.Seagull_AnimationBlueprint_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_Seagull_AnimationBlueprint_AnimGraphNode_BlendListByInt_85473F0A4FD880EC4878C4AE83C6B14A();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_IdleEnd();
	void ExecuteUbergraph_Seagull_AnimationBlueprint(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
